package ua.javarush;

public class TelegramBotContent {
    public static final String STEP_1_TEXT = """
            *ВІТАЄМО НА ПЕРШОМУ РІВНІ!*
                                                                  
            Ти прокидаєшся і розумієш, що ти — кіт. Ранок добрий, але що це за дивні відчуття? Твій живіт бурчить від шаленого голоду. Їжі у квартирі немає, хіба що в закритому холодильнику. Що ж робити?
            
            Доведеться згадати, як хакати цифровий холодильник. Відкриваємо книжку "Просунутий хакінг для Котів":
            
                1. Виконай перше завдання, а потім перегорни сторінку!
                2. Прокачайся та переходь до найцікавішого!
                3. Вчини діяння, щоб заслужити повагу серед усіх місцевих котів!
            
            *Кіт домашній звичайніус, рівень перший.*
            Зламай цифровий холодильник та виконай перше завдання!
            """;

    public static final String STEP_2_TEXT = """
            *ВІТАЄМО НА ДРУГОМУ РІВНІ!*
                                  
            Юху! Ти здолав холодильник. Ти отримуєш +20 слави!
            
            _Накопичено: 20 слави._
            
            Обирай свою нагороду:
            """;

    public static final String STEP_3_TEXT = """
            *Кіт Айтішнік, рівень другий.*
            Несподівано, з-за кута виповз дзижчащий робот-пилосос. Настав час помсти!
            Виконай друге завдання та зламай його!
            """;

    public static final String STEP_4_TEXT = """
            *ВІТАЄМО НА ТРЕТЬОМУ РІВНІ!*
                                    
            Ти здолав робопилосос! Ти отримуєш +30 слави!
                                      
            _Накопичено: 70 слави._
            
            Обирай свою нагороду:
            """;

    public static final String STEP_5_TEXT = """
            *Кіт Робопідкорювач, рівень третій.*
            Хо-хо! На шафі виявлений нічийний GoPro!
            Виконай третє завдання — одягни та включи його!
            """;

    public static final String STEP_6_TEXT = """
            *ВІТАЄМО НА ЧЕТВЕРТОМУ РІВНІ!*
                                    
            Ти одягнув GoPro! Ти отримуєш +40 слави!
                                    
            _Накопичено: 140 слави._
            
            Обирай свою нагороду:
            """;

    public static final String STEP_7_TEXT = """
            *Кіт Відеоблогер, рівень четвертий.*
            Тепер знятий матеріал треба залити на комп'ютер.
            Виконай четверте завдання — зламай пароль від комп'ютера!
            """;

    public static final String STEP_8_TEXT = """
            *ВІТАЄМО НА П'ЯТОМУ РІВНІ!*
            
            Ти здолав комп'ютер! Ти отримуєш +50 слави!
            
            _Накопичено: 230 слави._
            """;

    public static final String FINAL_TEXT = """
            *Кіт Хакер, рівень п'ятий.*
            День минув не даремно: кіт-хакер вчинив свої діяння та заслужив повагу серед місцевих дворових котів.
            """;
}
